app/controllers/users_controller.rb

  def index
    @users = User.order(:id)
---
SELECT "users".* FROM "users" ORDER BY "users"."id" ASC

  def create
    @user = User.new(
      user_params.merge(
        qr_code: params[:qr_code].presence || user_params[:qr_code].presence || "user-#{SecureRandom.uuid}",
        status: "alive"
      )
    )

    if @user.save
---
INSERT INTO "users" ("name", "status", "kill_count", "qr_code", "killed_user_ids", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def manual_edit
    @users = User.order(:name, :id)
    @user = @users.find_by(id: params[:user_id]) || @users.first
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def manual_update
    @user = User.find(params[:user_id])
    attributes = manual_input_params
    victim_ids = Array(attributes[:killed_user_ids]).reject(&:blank?).map(&:to_i).uniq
    killer_id = attributes[:killer_id].presence&.to_i
    related_ids = victim_ids + [killer_id].compact

    unless User::VALID_STATUSES.include?(attributes[:status]) &&
           !related_ids.include?(@user.id) &&
           User.where(id: related_ids).count == related_ids.uniq.count
      return redirect_to manual_input_path(user_id: @user.id), alert: "Choose a valid status and other existing players."
    end

    User.transaction do
      @user.update!(status: attributes[:status])

      @user.kills_as_killer.where.not(victim_id: victim_ids).destroy_all
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "status" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["status", "killed"], ["updated_at", "2026-09-22 20:41:26.006487"], ["id", 18]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]

  def set_user
    @user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]