app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."qr_code" = $1 LIMIT $2  [["qr_code", "user-86dc246e-d18f-4051-ae8c-942f4caaa452"], ["LIMIT", 1]]
SELECT 1 AS one FROM "users" WHERE "users"."qr_code" = $1 AND "users"."id" != $2 LIMIT $3  [["qr_code", "user-e4b8d622-90fc-42a5-bb72-dff0cb4edb44"], ["id", 18], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."qr_code" = $1 LIMIT $2  [["qr_code", "user-e4b8d622-90fc-42a5-bb72-dff0cb4edb44"], ["LIMIT", 1]]
UPDATE "users" SET "status" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["status", "killed"], ["updated_at", "2026-09-22 20:41:26.006487"], ["id", 18]]
---
  def scan
    # @players = User.where(status: "alive").where.not(name: nil).order(:name)
    return unless request.post?

    code = params[:qr_code].to_s.strip
    killer = User.find_by(id: params[:killer_id])

    if code.blank?
      redirect_to scan_path, alert: "No QR code was provided."
      return
    end

    unless killer&.alive?
      redirect_to scan_path, alert: "Choose your player before scanning."
      return
    end

    session[:user_id] = killer.id
    user = User.find_by(qr_code: code)

    if user.nil?
      redirect_to new_user_path(qr_code: code), notice: "That QR code is not attached to a player yet."
      return
    end

    if user.name.blank?
      name = params[:target_name].to_s.strip

      if name.present?
        unless user.update(name: name)

INSERT INTO "users" ("name", "status", "kill_count", "qr_code", "killed_user_ids", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @user = User.new(
      user_params.merge(
        qr_code: params[:qr_code].presence || user_params[:qr_code].presence || "user-#{SecureRandom.uuid}",
        status: "alive"
      )
    )

    if @user.save