app/models/user.rb

  def self.highscores
    left_joins(:kills_as_killer)
      .select("users.*, COUNT(kills.id) AS kills_count")
      .group("users.id")
      .order(Arel.sql("COUNT(kills.id) DESC, users.name ASC, users.id ASC"))
      .limit(5)
---
SELECT COUNT(*) FROM "users"

  def self.find_or_initialize_by_qr_code(qr_code)
    normalized = qr_code.to_s.strip
    return new if normalized.blank?
---
SELECT "users".* FROM "users" WHERE "users"."qr_code" = $1 LIMIT $2  [["qr_code", "user-abc-123"], ["LIMIT", 1]]
SELECT 1 AS one FROM "users" WHERE "users"."qr_code" = $1 LIMIT $2  [["qr_code", "user-abc-123"], ["LIMIT", 1]]

  def qr_code_png_data_uri
    return if qr_code.blank?
---
SELECT 1 AS one FROM "users" WHERE "users"."qr_code" = $1 AND "users"."id" != $2 LIMIT $3  [["qr_code", "user-3459f83a-6ea9-4c32-bd97-b562c51674f1"], ["id", 24], ["LIMIT", 1]]

  def kill!(victim)
    return false if victim == self || !victim.alive?
    return false if kills_as_killer.exists?(victim_id: victim.id)

    self.class.transaction do
      victim.lock!
      return false unless victim.alive?
      return false if kills_as_killer.exists?(victim_id: victim.id)

      kills_as_killer.create!(victim: victim)
      victim.update!(status: "killed")
---
UPDATE "users" SET "kill_count" = $1, "killed_user_ids" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["kill_count", 1], ["killed_user_ids", "{24}"], ["updated_at", "2026-09-22 20:54:37.377714"], ["id", 23]]